tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  clear;
    }
    {
        name    c0;
        type    cellSet;
        action  invert;
    }
    {
        name    c0;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (0.4 0.1 0.1) (0.6 0.3 0.3);
        }
    }
    {
        name    c0;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (0.4 0.1 0.4) (0.6 0.3 0.6);
        }
    }
    {
        name    c0;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (0.4 0.4 0.1) (0.6 0.6 0.3);
        }
    }
    {
        name    c0;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (0.4 0.4 0.4) (0.6 0.6 0.6);
        }
    }
);

// ************************************************************************* //
